---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarCurvesData
source: html/71996f44-c8f9-7695-ccb9-efae09726c9c.htm
---
# Autodesk.Revit.DB.Structure.RebarCurvesData

The class that contains the information needed to calculate and return the result of the external curve generation.

## Syntax (C#)
```csharp
public class RebarCurvesData : IDisposable
```